server/performance/tests/test-results.yml
# ==============================================================================
# tests/test-results.yml — Performance tests for Lab Test Result routes
# Route file : server/src/routes/TestManagement/testResultRoutes.js
# Base URL   : http://localhost:8081
# Mounted at : /api/test-results
# Endpoints tested:
#   GET  /api/test-results                       → All results (admin/lab view)
#   GET  /api/test-results/patient/:patientId    → Results for a patient
#   POST /api/test-results                       → Record a new test result
#   PUT  /api/test-results/:id                   → Update an existing result
# ==============================================================================
#
# Run this test:
#   npx artillery run server/performance/tests/test-results.yml
# ==============================================================================

config:
  target: "http://localhost:5000"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  variables:
    patientId: "REPLACE_WITH_REAL_PATIENT_ID"
    testResultId: "REPLACE_WITH_REAL_TEST_RESULT_ID"
    testTypeId: "REPLACE_WITH_REAL_TEST_TYPE_ID"

  phases:
    - name: "Warm-up"
      duration: 10
      arrivalRate: 2

    - name: "Ramp-up"
      duration: 30
      arrivalRate: 2
      rampTo: 15

    - name: "Sustained load"
      duration: 60
      arrivalRate: 15

  plugins:
    metrics-by-endpoint: {}

scenarios:
  # ============================================================================
  # SCENARIO 1 — Get all test results (admin/lab tech dashboard)
  # Likely a paginated collection scan — watch p95 latency carefully.
  # ============================================================================
  - name: "List all test results"
    weight: 2
    flow:
      # GET /api/test-results
      - get:
          url: "/api/test-results"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 2 — Get a patient's test results
  # Highest-frequency read: patients and doctors checking lab results.
  # Measures how efficiently the DB can query by patientId.
  # ============================================================================
  - name: "Get test results for a patient"
    weight: 5
    flow:
      # GET /api/test-results/patient/:patientId
      - get:
          url: "/api/test-results/patient/{{ patientId }}"
          expect:
            - statusCode: 200

  # ============================================================================
  # SCENARIO 3 — Record a new test result (lab tech entry)
  # Write-heavy operation — tests DB insert throughput.
  # ============================================================================
  - name: "Create a new test result"
    weight: 2
    flow:
      # POST /api/test-results
      - post:
          url: "/api/test-results"
          json:
            # Adjust fields to match your TestResult Mongoose schema
            patientId: "{{ patientId }}"
            testTypeId: "{{ testTypeId }}"
            result: "Negative"
            remarks: "Auto-generated by performance test"
            conductedDate: "2026-04-01"
          expect:
            - statusCode:
                - 200
                - 201

  # ============================================================================
  # SCENARIO 4 — Update an existing test result
  # Lab tech corrects or adds remarks — low frequency, but tests update path.
  # ============================================================================
  - name: "Update a test result"
    weight: 1
    flow:
      # PUT /api/test-results/:id
      - put:
          url: "/api/test-results/{{ testResultId }}"
          json:
            remarks: "Updated remarks — performance test run"
          expect:
            - statusCode:
                - 200
                - 404    # may 404 under concurrent deletes — acceptable